plugins-available/mu4e.org
* mu4e
** 概要

[[https://github.com/ychubachi/.emacs.d/blob/master/plugins-available/mu4e.org][.emacs.d/plugins-available/mu4e.org at master · ychubachi/.emacs.d]]

mu4eは，offlineimap及びmaildir-toolsと組み合わせることで動作する，
軽快なIMAPサーバ用メールリーダである．

** OfflineImap

offlineImapは，IMAPサーバにあるメールをローカルのファイルに
同期するツールである．DropboxやOneDriveのIMAP版と考えれば
分かりやすいかもしれない．

IMAPのサーバとして，Gmailを用いる場合の設定例を示す．

IMAPのフォルダ名を英語にするため，Gmailは「英語」の設定にする．
日本語のフォルダ名を，offlineimapのnametrans機能で
日本語に変換することもできるのだが，
筆者が試行錯誤したところ，このことに起因すると思われる
文字コードに関連したエラーが発生してしまった．
安定的な動作を期するため，Gmailの設定画面において、
「使用する言語」を英語にしておくのが良さそうだ．

ローカルにはMaildir形式でメールを格納する．

Gmailでラベルを使用していたが，muでの検索機能が優れているので，全て削除した．

- [[http://docs.offlineimap.org/en/latest/][Welcome to offlineimaps‘s documentation — OfflineImap 6.5.4 documentation]]
- [[http://gihyo.jp/admin/serial/01/ubuntu-recipe/0247?page=1][第247回　Offlineimap＋Dovecotによる快適メール環境：Ubuntu Weekly Recipe｜gihyo.jp … 技術評論社]]
- [[http://piao-tech.blogspot.jp/2010/03/get-offlineimap-working-with-non-ascii.html][私のTech記憶: Get offlineimap working with non ASCII characters.]]

- インストール
  - sudo apt-get install offlineimap

- 設定例
  - [[https://github.com/spaetz/offlineimap/blob/master/offlineimap.conf][offlineimap/offlineimap.conf at master · spaetz/offlineimap]]

.netrcに，imapのログイン名とパスワードを書いておく．

初回実行したら，97,388件のメールをダウンロードするのに508分55秒かかった．

- zsh
  offlineimap &!
- bash
  nohup offlineimap &

** mu

muは，MaildirにあるメールをDB化します．
表示や検索が素早く行えるようになります．
検索が優れているので，ファルダを利用してメールを整理する必要がありません．

- mu (maildir-utils)
  - [[http://www.djcbsoftware.nl/code/mu/mu4e/index.html#Top][mu4e user manual]]
  - [[http://code.google.com/p/mu0/downloads/detail?name=mu4e-manual-0.9.9.pdf][mu4e-manual-0.9.9.pdf - mu0 - mu4e v0.9.9 manual - mu is a collection of utilties for indexing and searching Maildirs - Google Project Hosting]]
  - [[https://github.com/djcb/mu][djcb/mu]]
  - [[http://www.brool.com/index.php/using-mu4e][Using mu4e | brool]]

- インストール
  - sudo apt-get install mu4e mildir-utils-extra

- mu index

こちらは510.57秒．

** バックグラウンド
offlineimapをcrontabで定期的に実行する．muのインデックスも同時に行う．

** custom.el
- custom.el
  (user-mail-address "yoshi@chubachi.net")
  (user-full-name  "Yoshihide Chubachi")
  (message-signature "Yoshihide Chubachi @AIIT")
  (smtpmail-smtp-user "yoshihide.chubachi@gmail.com")

- これはよくわからない
  '(mu4e-user-mail-address-list (quote ("yc@aiit.ac.jp" "yoshi@chubachi.net" "yoshihide.chubachi@gmail.com")))

** Emacsの設定

#+begin_src emacs-lisp
  (require 'mu4e)
  (require 'org-mu4e)
#+end_src

mu4eで用いるGmailのフォルダを指定する．
GmailのSentフォルダは設定せず，All Mailフォルダを指定する．

#+begin_src emacs-lisp
  (setq mu4e-maildir       "~/Maildir")
  (setq mu4e-sent-folder   "/[Gmail].All Mail")
  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-trash-folder  "/[Gmail].Trash")
  (setq mu4e-refile-folder "/[Gmail].All Mail")
#+end_src

don't save message to Sent Messages, Gmail/IMAP takes care of this

#+begin_src emacs-lisp
  (setq mu4e-sent-messages-behavior 'delete)
#+end_src

      ;; setup some handy shortcuts
      ;; you can quickly switch to your Inbox -- press ``ji''
      ;; then, when you want archive some messages, move them to
      ;; the 'All Mail' folder by pressing ``ma''.

rでrefileしたほうが便利．

#+begin_src emacs-lisp
  (setq mu4e-maildir-shortcuts
	'( ("/INBOX"             . ?i)
	   ("/[Gmail].All Mail"  . ?a)
	   ("/[Gmail].Drafts"    . ?d)
	   ("/[Gmail].Trash"     . ?t)))
#+end_src

SMTPの設定．Emacs標準のコンポーネント．

#+begin_src emacs-lisp
  (require 'smtpmail)
  (setq message-send-mail-function 'smtpmail-send-it
	smtpmail-stream-type 'starttls
	smtpmail-default-smtp-server "smtp.gmail.com"
	smtpmail-smtp-server "smtp.gmail.com"
	smtpmail-smtp-service 587)
#+end_src

offlineimapをmu4eから呼び出す設定．
間隔を5分に．

- [[http://www.djcbsoftware.nl/code/mu/mu4e/Retrieval-and-indexing.html#Retrieval-and-indexing][Retrieval and indexing - mu4e user manual]]

#+begin_src emacs-lisp
  ;; (setq
  ;;    mu4e-get-mail-command "offlineimap"
  ;;    mu4e-update-interval 300)
#+end_src

#+begin_src emacs-lisp
  ;; don't keep message buffers around
  (setq message-kill-buffer-on-exit t)

  ;; show images
  (setq mu4e-show-images t)

  ;; use imagemagick, if available
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))

  (setq mu4e-msg2pdf "/usr/bin/msg2pdf")

  (add-to-list 'mu4e-view-actions
	       '("View in browser" . mu4e-action-view-in-browser) t)

  ;; convert org mode to HTML automatically
  (setq org-mu4e-convert-to-html t)

#+end_src

HTML形式のメールをEmacs内で読むためにテキスト形式に整形するための
コマンドを指定する．
html2textも利用できるが，Shift JISに対応していない．

#+begin_src emacs-lisp
  (setq mu4e-html2text-command "w3m -dump -T text/html")
#+end_src


Gmailでスターをつけると，flagが付く．
そこで，これを検索するブックマークを追加する．

#+begin_src emacs-lisp
  (add-to-list 'mu4e-bookmarks '("flag:flagged" "Flagged (Starred in Gmail)" ?s))
#+end_src

#+begin_src emacs-lisp
  (defalias 'org-mail 'org-mu4e-compose-org-mode)
#+end_src

ヘッダ一覧画面に表示される日付と時刻の表示形式を設定する．
当日のメールにも日付が表示されるようにした．

#+begin_src emacs-lisp
  (setq mu4e-headers-date-format "%y-%m-%d %H:%M")
  (setq mu4e-headers-time-format "%y-%m-%d %H:%M")
#+end_src

#+RESULTS:
: %y-%m-%d %H:%M

ヘッダーに表示する列と幅を指定する．

#+begin_src emacs-lisp
  (setq mu4e-headers-fields
	'((:human-date . 14)
	  (:flags . 6)
	  (:from . 15)
	  (:subject)))
#+end_src

#+RESULTS:
| (:human-date . 14) | (:flags . 6) | (:from . 15) | (:subject) |

メールが/INDEXと/[Gmail]/All Mailの両方に存在する状態の場合，
検索結果に両方が含まれる．次の設定をすることにより，
重複を除外して表示する．

#+begin_src emacs-lisp
  (setq mu4e-headers-skip-duplicates 't)
#+end_src

#+RESULTS:
: t


5分ごとに，自動的にインデックスをアップデートします．

#+begin_src emacs-lisp
  (setq mu4e-update-interval 300)
#+end_src

#+RESULTS:
: 300
